app/controllers/answers_controller.rb

  def create
    @answer = current_user.answers.build(answer_params)

    if @answer.save
---
INSERT INTO "answers" ("answer_many", "user_id", "question_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["answer_many", "hot dog is not sandwiched"], ["user_id", 1], ["question_id", 1], ["created_at", "2021-10-01 14:09:37.107011"], ["updated_at", "2021-10-01 14:09:37.107011"]]

  def find_answer
    @answer = current_user.answers.find_by(id: params[:id])
---
SELECT "answers".* FROM "answers" WHERE "answers"."user_id" = $1  [["user_id", 1]]